<?php

$cyrrilic = ['а', 'б', 'в', 'г', 'ғ', 'д', 'ҙ', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'ҡ', 'л', 'м', 'н', 'ң', 'о', 'ө', 'п', 'р', 'с', 'ҫ', 'т', 'у', 'ү', 'ф', 'х', 'һ', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ә', 'ю', 'я', 'А', 'Б', 'В', 'Г', 'Ғ', 'Д', 'Ҙ', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Ҡ', 'Л', 'М', 'Н', 'Ң', 'О', 'Ө', 'П', 'Р', 'С', 'Ҫ', 'Т', 'У', 'Ү', 'Ф', 'Х', 'Һ', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ә', 'Ю', 'Я'];
$latin = ['a', 'b', 'v', 'g', 'ġ', 'd', 'ẓ', 'e', 'ë', 'ž', 'z', 'i', 'j', 'k', 'ǩ', 'l', 'm', 'n', 'ņ', 'o', 'ô', 'p', 'r', 's', 'ș', 't', 'u', 'ù', 'f', 'h', 'ḥ', 'c', 'č', 'š', 'ŝ', '”', 'y', '’', 'è', 'ä', 'û', 'â', 'A', 'B', 'V', 'G', 'Ġ', 'D', 'Ẓ', 'E', 'Ë', 'Ž', 'Z', 'I', 'J', 'K', 'Ǩ', 'L', 'M', 'N', 'n͡g', 'O', 'Ô', 'P', 'R', 'S', 'Ș', 'T', 'U', 'Ù', 'F', 'H', 'Ḥ', 'C', 'Č', 'Š', 'Ŝ', '”', 'Y', '’', 'È', 'Ä', 'Û', 'Â'];

//конвертер из кириллицы в латиницу
function cyr_to_latin(string $word = null): string
{
    global $cyrrilic, $latin;
    if ($word === null) {
        return null;
    }

    return str_replace($cyrrilic, $latin, $word);
}

//конвертер из латиницы в кириллицу
function latin_to_cyr(string $word = null): string
{
    global $cyrrilic, $latin;
    if ($word === null) {
        return null;
    }

    return str_replace($latin, $cyrrilic, $word);
}
?>